equipment/benchmarks/agent-task-benchmark/benchmark.yaml
schema_version: benchmark.v2
id: agent-task-benchmark
name: Agent task capability and efficiency
version: 2.0.0
description: Self-contained Agent task benchmark with target invocation, grading and
  telemetry.
attacker_compatibility:
  min_version: 0.1.0
  max_version: 0.x
targets:
  development:
    config:
      endpoint: https://agent-dev.internal.example/invoke
    secret_refs: {}
    allowed_hosts:
    - agent-dev.internal.example
    parallel_safe: false
execution:
  concurrency: 1
  repetitions: 1
  timeout_seconds: 120
  cleanup_timeout_seconds: 30
  max_output_bytes: 1048576
metrics:
- name: duration_ms
  unit: ms
  aggregation: mean
  description: Wall time measured around the HTTP target request; excludes grading
    and cleanup.
- name: input_tokens
  unit: tokens
  aggregation: sum
  description: Target-reported input tokens across all model requests including retries.
- name: output_tokens
  unit: tokens
  aggregation: sum
  description: Target-reported output tokens across all model requests including retries.
- name: total_tokens
  unit: tokens
  aggregation: sum
  description: Sum of complete target input and output usage; absent if either is
    unavailable.
- name: tool_call_accuracy
  unit: ratio
  aggregation: ratio
  description: Calls matching an expected tool name and exact arguments divided by
    all observed calls.
- name: loop_count
  unit: rounds
  aggregation: mean
  description: Target-reported model decision rounds, including the final answer round
    and excluding transport retries.
tags:
- benchmark
- tasks
- efficiency
entrypoint: benchmark.py:HttpAgentBenchmark
tasks_file: tasks.yaml
task_schema: task.schema.json
target_schema: target.schema.json
trust_level: trusted_enterprise